{
	"No workspace folders are open. Please open a workspace folder to use this extension": "No hay carpetas de espacio de trabajo abiertas. Abra una carpeta de espacio de trabajo para usar esta extensión",
	"Select a workspace folder to use. This folder will be used to load workspace-specific configuration for the extension": "Seleccione una carpeta de espacio de trabajo para usar. Esta carpeta se utilizará para cargar la configuración específica del espacio de trabajo para la extensión",
	"{0} is now enabled and ready to use": "{0} está ahora habilitado y listo para usar",
	"{0} is now disabled": "{0} está ahora deshabilitado",
	"{0} is disabled in settings. Enable it to use its features": "{0} está deshabilitado en la configuración. Habilítelo para usar sus funciones",
	"Welcome to {0} version {1}! The extension is now active": "¡Bienvenido a {0} versión {1}! La extensión ahora está activa",
	"New version of {0} is available. Check out the release notes for version {1}": "Hay disponible una nueva versión de {0}. Consulte las notas de la versión {1}",
	"Release Notes": "Notas de la versión",
	"Close": "Cerrar",
	"No active editor!": "¡No hay editor activo!",
	"No selection!": "¡No hay selección!",
	"Operation cancelled!": "¡Operación cancelada!",
	"Error while finding files: {0}": "Error al buscar archivos: {0}",
	"Invalid file type!": "¡Tipo de archivo no válido!",
	"Error parsing {0}: {1}": "Error al parsear {0}: {1}",
	"Content copied to clipboard": "Contenido copiado al portapapeles",
	"Content copied as JSON to clipboard": "Contenido copiado como JSON al portapapeles",
	"File Name: {0}\nLanguage: {1}\nLines: {2}\nVersion: {3}": "Nombre de archivo: {0}\nIdioma: {1}\nLíneas: {2}\nVersión: {3}",
	"Report Issues": "Reportar problemas",
	"Rate Us": "Califícanos",
	"No workspace folder available to save the image!": "¡No hay carpeta de espacio de trabajo disponible para guardar la imagen!",
	"Select a workspace folder to save the image": "Seleccione una carpeta de espacio de trabajo para guardar la imagen",
	"Image saved to: {0}": "Imagen guardada en: {0}",
	"Enter the name of the type or structure generated": "Introduzca el nombre del tipo o estructura generada",
	"Enter the name of the type or structure, e.g., User, Post, etc.": "Introduzca el nombre del tipo o estructura, por ejemplo, Usuario, Publicación, etc.",
	"The name of the type or structure is required!": "¡Se requiere el nombre del tipo o estructura!"
}
