{
	"No workspace folders are open. Please open a workspace folder to use this extension": "Aucun dossier d'espace de travail n'est ouvert. Veuillez ouvrir un dossier d'espace de travail pour utiliser cette extension",
	"Select a workspace folder to use. This folder will be used to load workspace-specific configuration for the extension": "Sélectionnez un dossier d'espace de travail à utiliser. Ce dossier sera utilisé pour charger la configuration spécifique à l'espace de travail pour l'extension",
	"{0} is now enabled and ready to use": "{0} est maintenant activé et prêt à être utilisé",
	"{0} is now disabled": "{0} est maintenant désactivé",
	"{0} is disabled in settings. Enable it to use its features": "{0} est désactivé dans les paramètres. Activez-le pour utiliser ses fonctionnalités",
	"Welcome to {0} version {1}! The extension is now active": "Bienvenue dans la version {0} {1} ! L'extension est maintenant active",
	"New version of {0} is available. Check out the release notes for version {1}": "Une nouvelle version de {0} est disponible. Consultez les notes de version pour la version {1}",
	"Release Notes": "Notes de version",
	"Close": "Fermer",
	"No active editor!": "Aucun éditeur actif!",
	"No selection!": "Aucune sélection!",
	"Operation cancelled!": "Opération annulée!",
	"Error while finding files: {0}": "Erreur lors de la recherche des fichiers : {0}",
	"Invalid file type!": "Type de fichier non valide!",
	"Error parsing {0}: {1}": "Erreur d'analyse de {0} : {1}",
	"Content copied to clipboard": "Contenu copié dans le presse-papiers",
	"Content copied as JSON to clipboard": "Contenu copié en tant que JSON dans le presse-papiers",
	"File Name: {0}\nLanguage: {1}\nLines: {2}\nVersion: {3}": "Nom du fichier : {0}\nLangue : {1}\nLignes : {2}\nVersion : {3}",
	"Report Issues": "Signaler des problèmes",
	"Rate Us": "Évaluez-nous",
	"No workspace folder available to save the image!": "Aucun dossier d'espace de travail disponible pour enregistrer l'image!",
	"Select a workspace folder to save the image": "Sélectionnez un dossier d'espace de travail pour enregistrer l'image",
	"Image saved to: {0}": "Image enregistrée sous : {0}",
	"Enter the name of the type or structure generated": "Entrez le nom du type ou de la structure généré",
	"Enter the name of the type or structure, e.g., User, Post, etc.": "Entrez le nom du type ou de la structure, par exemple, Utilisateur, Post, etc.",
	"The name of the type or structure is required!": "Le nom du type ou de la structure est requis!"
}
